# Проект FitLife - MVP версия 1.0


# 1. Знакомство
print("Привет, я помогу тебе позаботиться о своем здоровье!")
print("Давай знакомиться!")
# Запрос имени пользователя
user_name = input("Как тебя зовут? ")
print(f"Привет, {user_name}!")
# Запрос возраста и преобразование в число
user_age = int(input("Сколько тебе полных лет? "))

# 2. Сбор данных
# Запрос веса пользователя и преобразование во float
user_weight = float(input("Укажи свой вес в кг (например, 76.6) "))
# Запрос роста пользователя и преобразование во float
user_height = float(input("Укажи свой рост в метрах (например, 1.75) "))

# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
# Формула ИМТ: вес разделить на (рост в квадрате)
# Рассчет bmi (Индекс массы тела) и округление до десятых
bmi = round((user_weight / (user_height ** 2)), 1)

# Подсчет воды: вес * 30 мл в миллилитрах
water_needed_ml = user_weight * 30
# Перевод воды в литры и округление до сотых
water_needed_l = (water_needed_ml / 1000)

# 4. Вывод красивого результата
print(f"Отчет для пользователя: {user_name} ({user_age} г.)")
print(f"Твой Индекс Массы Тела: {bmi}")
print(f"Норма жидкости: {water_needed_l:.2f} л. в день")
print("")
print("Расчет окончен. Будьте здоровы!")
