# Проект FitLife - MVP версия 1.0
# Константы
WATER_PER_KG = 30


# 1. Знакомство
print("Привет, я помогу тебе позаботиться о своем здоровье!")
print("Давай знакомиться!")
# Запрос имени пользователя
user_name = input("Как тебя зовут? ")
print(f"Привет, {user_name}!")
# Запрос возраста и преобразование в число
try:
    user_age = int(input("Сколько тебе полных лет? "))
except ValueError:
    print("Ты ввел не число!")
# 2. Сбор данных
# Запрос веса пользователя и преобразование во float
try:
    user_weight = float(input("Укажи свой вес в кг (например, 76.6) "))
except ValueError:
    print("Нужно ввести число с плавающей точкой!")
# Запрос роста пользователя и преобразование во float
try:
    user_height = float(input("Укажи свой рост в метрах (например, 1.75) "))
except ValueError:
    print("Нужно ввести число с плавающей точкой!")

# 3. Логика расчетов (Функции как "черный ящик": используем арифметику)
# Формула ИМТ: вес разделить на (рост в квадрате)
# Рассчет bmi (Индекс массы тела) и округление до десятых
bmi = round((user_weight / (user_height ** 2)), 1)

# Подсчет воды: вес * 30 мл в миллилитрах, перевод в литры
water_needed = user_weight * WATER_PER_KG / 1000

# 4. Вывод красивого результата
print(f"Отчет для пользователя: {user_name} ({user_age} г.)")
print(f"Твой Индекс Массы Тела: {bmi}")
print(f"Норма жидкости: {water_needed:.2f} л. в день")
print("")
print("Расчет окончен. Будьте здоровы!")
